app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "grade", "created_at", "updated_at", "username", "hashed_password", "entries_count", "score", "albums_count", "email") VALUES(E'3520038000.745281407190278', NULL, '2009-03-17 09:30:39.793049', '2009-03-17 09:30:39.793049', E'aaaa', E'cc9f5e137dabcc80a9aa16d59f5be471b311b32c', NULL, NULL, NULL, E'aaaa@126.com') RETURNING "id"
---
  def create
    @user = User.new(params[:user])
    if @user.save